rayray2002/Ferris-Cabinet/psoc6/source/main.c
/******************************************************************************
 * File Name: main.c
 *
 * Description: This code example features a 5-segment CapSense slider and two
 *              CapSense buttons. Button 0 turns the LED ON, Button 1 turns the
 *              LED OFF, and the slider controls the brightness of the LED. The
 *              code example also features interfacing with Tuner GUI using I2C
 *              interface.
 *
 *              This code example uses FreeRTOS. For documentation and API
 *              references of FreeRTOS, visit : https://www.freertos.org
 *
 * Related Document: See README.md
 *
 *
 *******************************************************************************
 * Copyright 2019-2022, Cypress Semiconductor Corporation (an Infineon company) or
 * an affiliate of Cypress Semiconductor Corporation.  All rights reserved.
 *
 * This software, including source code, documentation and related
 * materials ("Software") is owned by Cypress Semiconductor Corporation
 * or one of its affiliates ("Cypress") and is protected by and subject to
 * worldwide patent protection (United States and foreign),
 * United States copyright laws and international treaty provisions.
 * Therefore, you may use this Software only as provided in the license
 * agreement accompanying the software package from which you
 * obtained this Software ("EULA").
 * If no EULA applies, Cypress hereby grants you a personal, non-exclusive,
 * non-transferable license to copy, modify, and compile the Software
 * source code solely for use in connection with Cypress's
 * integrated circuit products.  Any reproduction, modification, translation,
 * compilation, or representation of this Software except as specified
 * above is prohibited without the express written permission of Cypress.
 *
 * Disclaimer: THIS SOFTWARE IS PROVIDED AS-IS, WITH NO WARRANTY OF ANY KIND,
 * EXPRESS OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, NONINFRINGEMENT, IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE. Cypress
 * reserves the right to make changes to the Software without notice. Cypress
 * does not assume any liability arising out of the application or use of the
 * Software or any product or circuit described in the Software. Cypress does
 * not authorize its products for use in any products where a malfunction or
 * failure of the Cypress product may reasonably be expected to result in
 * significant property damage, injury or death ("High Risk Product"). By
 * including Cypress's product in a High Risk Product, the manufacturer
 * of such system or application assumes all risk of such use and in doing
 * so agrees to indemnify Cypress against all liability.
 *******************************************************************************/

#include "FreeRTOS.h"
#include "alarm_task.h"
#include "capsense_task.h"
#include "cy_pdl.h"
#ifndef DISABLE_RETARGET_IO
#include "cy_retarget_io.h"
#endif
#include "cybsp.h"
#include "cyhal.h"
#include "interface_task.h"
#include "mqtt_task.h"
#include "queue.h"
#include "task.h"
#include "timers.h"

/*******************************************************************************
 * Global constants
 ******************************************************************************/
/* Priorities of user tasks in this project. configMAX_PRIORITIES is defined in
 * the FreeRTOSConfig.h and higher priority numbers denote high priority tasks.
 */
#define TASK_CAPSENSE_PRIORITY (configMAX_PRIORITIES - 1)
#define MQTT_CLIENT_TASK_PRIORITY (configMAX_PRIORITIES - 2)
#define TASK_INTERFACE_PRIORITY (configMAX_PRIORITIES - 3)
#define ALARM_TASK_PRIORITY (0)

/* Stack sizes of user tasks in this project */
#define TASK_CAPSENSE_STACK_SIZE (256u)
#define TASK_INTERFACE_STACK_SIZE (1024 * 1)
#define MQTT_CLIENT_TASK_STACK_SIZE (1024 * 1)
#define ALARM_TASK_STACK_SIZE (1024 * 1)

/* Queue lengths of message queues used in this project */
#define SINGLE_ELEMENT_QUEUE (1u)

/*******************************************************************************
 * Function Name: main()
 ********************************************************************************
 * Summary:
 *  System entrance point. This function sets up user tasks and then starts
 *  the RTOS scheduler.
 *
 * Return:
 *  int
 *
 *******************************************************************************/
int main(void) {
    cy_rslt_t result;

    /* Initialize the device and board peripherals */
    result = cybsp_init();
    CY_ASSERT(result == CY_RSLT_SUCCESS);

    /* Initialize retarget-io to use the debug UART port */
#ifndef DISABLE_RETARGET_IO
    result = cy_retarget_io_init(CYBSP_DEBUG_UART_TX, CYBSP_DEBUG_UART_RX, CY_RETARGET_IO_BAUDRATE);
    CY_ASSERT(result == CY_RSLT_SUCCESS);
#endif

    /* Enable global interrupts */
    __enable_irq();

    printf("\x1b[2J\x1b[;H");

    printf("**********************************************************\r\n");
    printf("Start!!\r\n");
    printf("**********************************************************\r\n");

    /* Create the queues. See the respective data-types for details of queue
     * contents
     */
    capsense_command_q = xQueueCreate(SINGLE_ELEMENT_QUEUE, sizeof(capsense_command_t));
    capsense_event_data_q = xQueueCreate(SINGLE_ELEMENT_QUEUE, sizeof(capsense_event_data_t));
    alarm_command_q = xQueueCreate(SINGLE_ELEMENT_QUEUE, sizeof(alarm_command_t));

    /* Create the user tasks. See the respective task definition for more
     * details of these tasks.
     */
    xTaskCreate(task_capsense, "CapSense Task", TASK_CAPSENSE_STACK_SIZE, NULL,
                TASK_CAPSENSE_PRIORITY, NULL);
    xTaskCreate(task_interface, "Interface Task", TASK_INTERFACE_STACK_SIZE, NULL,
                TASK_INTERFACE_PRIORITY, NULL);
    xTaskCreate(mqtt_client_task, "MQTT Client task", MQTT_CLIENT_TASK_STACK_SIZE, NULL,
                MQTT_CLIENT_TASK_PRIORITY, NULL);
    xTaskCreate(alarm_task, "Alarm Task", ALARM_TASK_STACK_SIZE, NULL, ALARM_TASK_PRIORITY, NULL);

    /* Start the RTOS scheduler. This function should never return */
    vTaskStartScheduler();

    /********************** Should never get here ***************************/
    /* RTOS scheduler exited */
    /* Halt the CPU if scheduler exits */
    CY_ASSERT(0);

    for (;;) {
    }
}

/* [] END OF FILE  */
